Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70Q19.xml
        <register caption="Interrupt Line Enable Register" name="MCAN_ILE" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Enable Interrupt Line 0" mask="0x00000001" name="EINT0"/>
          <bitfield caption="Enable Interrupt Line 1" mask="0x00000002" name="EINT1"/>
        </register>
        <register caption="Global Filter Configuration Register" name="MCAN_GFC" offset="0x80" rw="RW" size="4">
          <bitfield caption="Reject Remote Frames Extended" mask="0x00000001" name="RRFE" values="MCAN_GFC__RRFE"/>
          <bitfield caption="Reject Remote Frames Standard" mask="0x00000002" name="RRFS" values="MCAN_GFC__RRFS"/>
          <bitfield caption="Accept Non-matching Frames Extended" mask="0x0000000C" name="ANFE" values="MCAN_GFC__ANFE"/>
          <bitfield caption="Accept Non-matching Frames Standard" mask="0x00000030" name="ANFS" values="MCAN_GFC__ANFS"/>
        </register>
        <register caption="Standard ID Filter Configuration Register" name="MCAN_SIDFC" offset="0x84" rw="RW" size="4">
          <bitfield caption="Filter List Standard Start Address" mask="0x0000FFFC" name="FLSSA"/>
          <bitfield caption="List Size Standard" mask="0x00FF0000" name="LSS"/>
        </register>
        <register caption="Extended ID Filter Configuration Register" name="MCAN_XIDFC" offset="0x88" rw="RW" size="4">
          <bitfield caption="Filter List Extended Start Address" mask="0x0000FFFC" name="FLESA"/>
          <bitfield caption="List Size Extended" mask="0x007F0000" name="LSE"/>
        </register>
        <register caption="Extended ID AND Mask Register" name="MCAN_XIDAM" offset="0x90" rw="RW" size="4">
          <bitfield caption="Extended ID Mask" mask="0x1FFFFFFF" name="EIDM"/>
        </register>
        <register caption="High Priority Message Status Register" name="MCAN_HPMS" offset="0x94" rw="R" size="4">
          <bitfield caption="Buffer Index" mask="0x0000003F" name="BIDX"/>
          <bitfield caption="Message Storage Indicator" mask="0x000000C0" name="MSI" values="MCAN_HPMS__MSI"/>
          <bitfield caption="Filter Index" mask="0x00007F00" name="FIDX"/>
          <bitfield caption="Filter List" mask="0x00008000" name="FLST"/>
        </register>
        <register caption="New Data 1 Register" name="MCAN_NDAT1" offset="0x98" rw="RW" size="4">
          <bitfield caption="New Data" mask="0x00000001" name="ND0"/>
          <bitfield caption="New Data" mask="0x00000002" name="ND1"/>
          <bitfield caption="New Data" mask="0x00000004" name="ND2"/>
          <bitfield caption="New Data" mask="0x00000008" name="ND3"/>
          <bitfield caption="New Data" mask="0x00000010" name="ND4"/>
          <bitfield caption="New Data" mask="0x00000020" name="ND5"/>
          <bitfield caption="New Data" mask="0x00000040" name="ND6"/>
          <bitfield caption="New Data" mask="0x00000080" name="ND7"/>
          <bitfield caption="New Data" mask="0x00000100" name="ND8"/>
          <bitfield caption="New Data" mask="0x00000200" name="ND9"/>
          <bitfield caption="New Data" mask="0x00000400" name="ND10"/>
          <bitfield caption="New Data" mask="0x00000800" name="ND11"/>
          <bitfield caption="New Data" mask="0x00001000" name="ND12"/>
          <bitfield caption="New Data" mask="0x00002000" name="ND13"/>
          <bitfield caption="New Data" mask="0x00004000" name="ND14"/>
          <bitfield caption="New Data" mask="0x00008000" name="ND15"/>
          <bitfield caption="New Data" mask="0x00010000" name="ND16"/>
          <bitfield caption="New Data" mask="0x00020000" name="ND17"/>
          <bitfield caption="New Data" mask="0x00040000" name="ND18"/>
          <bitfield caption="New Data" mask="0x00080000" name="ND19"/>
          <bitfield caption="New Data" mask="0x00100000" name="ND20"/>
          <bitfield caption="New Data" mask="0x00200000" name="ND21"/>
          <bitfield caption="New Data" mask="0x00400000" name="ND22"/>
          <bitfield caption="New Data" mask="0x00800000" name="ND23"/>
          <bitfield caption="New Data" mask="0x01000000" name="ND24"/>
          <bitfield caption="New Data" mask="0x02000000" name="ND25"/>
          <bitfield caption="New Data" mask="0x04000000" name="ND26"/>
          <bitfield caption="New Data" mask="0x08000000" name="ND27"/>
          <bitfield caption="New Data" mask="0x10000000" name="ND28"/>
          <bitfield caption="New Data" mask="0x20000000" name="ND29"/>
          <bitfield caption="New Data" mask="0x40000000" name="ND30"/>
          <bitfield caption="New Data" mask="0x80000000" name="ND31"/>
        </register>
        <register caption="New Data 2 Register" name="MCAN_NDAT2" offset="0x9C" rw="RW" size="4">
          <bitfield caption="New Data" mask="0x00000001" name="ND32"/>
          <bitfield caption="New Data" mask="0x00000002" name="ND33"/>
          <bitfield caption="New Data" mask="0x00000004" name="ND34"/>
          <bitfield caption="New Data" mask="0x00000008" name="ND35"/>
          <bitfield caption="New Data" mask="0x00000010" name="ND36"/>
          <bitfield caption="New Data" mask="0x00000020" name="ND37"/>
          <bitfield caption="New Data" mask="0x00000040" name="ND38"/>
          <bitfield caption="New Data" mask="0x00000080" name="ND39"/>
          <bitfield caption="New Data" mask="0x00000100" name="ND40"/>
          <bitfield caption="New Data" mask="0x00000200" name="ND41"/>
          <bitfield caption="New Data" mask="0x00000400" name="ND42"/>
          <bitfield caption="New Data" mask="0x00000800" name="ND43"/>
          <bitfield caption="New Data" mask="0x00001000" name="ND44"/>
          <bitfield caption="New Data" mask="0x00002000" name="ND45"/>
          <bitfield caption="New Data" mask="0x00004000" name="ND46"/>
          <bitfield caption="New Data" mask="0x00008000" name="ND47"/>
          <bitfield caption="New Data" mask="0x00010000" name="ND48"/>
          <bitfield caption="New Data" mask="0x00020000" name="ND49"/>
          <bitfield caption="New Data" mask="0x00040000" name="ND50"/>
          <bitfield caption="New Data" mask="0x00080000" name="ND51"/>
          <bitfield caption="New Data" mask="0x00100000" name="ND52"/>
          <bitfield caption="New Data" mask="0x00200000" name="ND53"/>
          <bitfield caption="New Data" mask="0x00400000" name="ND54"/>
          <bitfield caption="New Data" mask="0x00800000" name="ND55"/>
          <bitfield caption="New Data" mask="0x01000000" name="ND56"/>
          <bitfield caption="New Data" mask="0x02000000" name="ND57"/>
          <bitfield caption="New Data" mask="0x04000000" name="ND58"/>
          <bitfield caption="New Data" mask="0x08000000" name="ND59"/>
          <bitfield caption="New Data" mask="0x10000000" name="ND60"/>
          <bitfield caption="New Data" mask="0x20000000" name="ND61"/>
          <bitfield caption="New Data" mask="0x40000000" name="ND62"/>
          <bitfield caption="New Data" mask="0x80000000" name="ND63"/>
        </register>
        <register caption="Receive FIFO 0 Configuration Register" name="MCAN_RXF0C" offset="0xA0" rw="RW" size="4">
          <bitfield caption="Receive FIFO 0 Start Address" mask="0x0000FFFC" name="F0SA"/>
          <bitfield caption="Receive FIFO 0 Start Address" mask="0x007F0000" name="F0S"/>
          <bitfield caption="Receive FIFO 0 Watermark" mask="0x7F000000" name="F0WM"/>
          <bitfield caption="FIFO 0 Operation Mode" mask="0x80000000" name="F0OM"/>
        </register>
        <register caption="Receive FIFO 0 Status Register" name="MCAN_RXF0S" offset="0xA4" rw="R" size="4">
          <bitfield caption="Receive FIFO 0 Fill Level" mask="0x0000007F" name="F0FL"/>
          <bitfield caption="Receive FIFO 0 Get Index" mask="0x00003F00" name="F0GI"/>
          <bitfield caption="Receive FIFO 0 Put Index" mask="0x003F0000" name="F0PI"/>
          <bitfield caption="Receive FIFO 0 Fill Level" mask="0x01000000" name="F0F"/>
          <bitfield caption="Receive FIFO 0 Message Lost" mask="0x02000000" name="RF0L"/>
        </register>
        <register caption="Receive FIFO 0 Acknowledge Register" name="MCAN_RXF0A" offset="0xA8" rw="RW" size="4">
          <bitfield caption="Receive FIFO 0 Acknowledge Index" mask="0x0000003F" name="F0AI"/>
        </register>
